{
  "backend/main.mo": "Empty Motoko actor with no implemented logic.",
  "feature_evidence.json": "Defines a feature evidence report describing UI copyright removal changes and related files.",
  "frontend-file-summaries.txt": "Text file listing short descriptions of all major frontend components and configuration files.",
  "frontend/index.css": "Tailwind base and custom CSS defining color variables, dark mode theming, and global background/foreground styles.",
  "frontend/index.html": "HTML entry file setting up metadata, fonts, and loading the React app root.",
  "frontend/src/App.tsx": "Main React component managing the prompt, reveal state, layout, and section rendering for the Valentine experience.",
  "frontend/src/components/valentine/ClosingSection.tsx": "Closing section with hearts, a gratitude message, and buttons to scroll to top or replay the experience.",
  "frontend/src/components/valentine/FirstEntryLovePrompt.tsx": "Initial full‑screen prompt asking “Do you love me?” with an evasive No button and animated hearts.",
  "frontend/src/components/valentine/games/LoveQuizGame.tsx": "Multiple‑choice love quiz with scoring, animated feedback, and a results screen with restart support.",
  "frontend/src/components/valentine/games/MemoryMatchGame.tsx": "Icon‑based memory match game that shuffles pairs, tracks moves, checks matches, and displays a win screen.",
  "frontend/src/components/valentine/HeroSection.tsx": "Hero section with background image, animated hearts, headline text, and a button to scroll to the message section.",
  "frontend/src/components/valentine/MessageSection.tsx": "Displays the personalized love letter with a dimmed background image and styled card layout.",
  "frontend/src/components/valentine/PlaySection.tsx": "Game section toggling between memory match and love quiz games with themed UI.",
  "frontend/src/components/valentine/SectionNav.tsx": "Fixed top navigation bar enabling smooth scrolling between sections and replaying the surprise.",
  "frontend/src/components/valentine/SurpriseReveal.tsx": "Full‑screen animated heart reveal screen that fades out and triggers onReveal after a short delay.",
  "frontend/src/components/valentine/ValentineLayout.tsx": "Layout wrapper that centers content and optionally renders a repeating Valentine-themed background pattern.",
  "frontend/src/config/valentineContent.ts": "Static configuration storing Valentine messages, headings, and personalized text content.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor instance tied to the current Internet Identity, refreshing dependent queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Authentication provider and hook for managing Internet Identity login state, stored identities, and auth client setup.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file noting no backend queries are required.",
  "frontend/src/index.css": "Tailwind setup with custom Valentine-themed color variables and utility animations.",
  "frontend/src/main.tsx": "App entry point initializing React, InternetIdentityProvider, React Query, and global styles.",
  "frontend/tailwind.config.js": "Configures Tailwind with dark mode, custom fonts, colors, container settings, animations, and plugins.",
  "project_state.json": "Defines the project's metadata, features, and pending requests related to removing copyright text."
}