{
  "backend/main.mo": "Empty Motoko actor with no backend logic.",
  "feature_evidence.json": "Feature evidence report listing implemented Valentine features, associated files, components, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries of all frontend files for quick reference during build planning.",
  "frontend/index.css": "Global Tailwind-based stylesheet defining color variables, themes, and base styles.",
  "frontend/index.html": "HTML entry point loading fonts and mounting the React app root.",
  "frontend/src/App.tsx": "Main React app controlling intro, love prompt, reveal flow, and rendering all Valentine sections.",
  "frontend/src/components/valentine/ClosingSection.tsx": "Final section showing teddy animation and Yes/No choices with corresponding messages and replay/top navigation.",
  "frontend/src/components/valentine/FirstEntryLovePrompt.tsx": "Overlay prompt asking 'Do you love me?' with a moving No button and a proceed action on Yes.",
  "frontend/src/components/valentine/games/LoveQuizGame.tsx": "Interactive multiple‑choice love quiz with scoring, animated feedback, and a final results screen.",
  "frontend/src/components/valentine/games/MemoryMatchGame.tsx": "Memory matching game using icon pairs with flip logic, move counting, match checking, and win state.",
  "frontend/src/components/valentine/HeroSection.tsx": "Hero section with animated hearts, background image, and CTA to scroll to the message.",
  "frontend/src/components/valentine/MailLetterIntro.tsx": "Animated intro component showing a floating-hearts background and envelope reveal, notifying parent when opened or closed.",
  "frontend/src/components/valentine/MessageSection.tsx": "Displays the main Valentine message with styled background, heart icon, and formatted paragraphs from valentineContent.",
  "frontend/src/components/valentine/PlaySection.tsx": "Provides a game section letting users switch between a memory game and a love quiz using styled toggle buttons.",
  "frontend/src/components/valentine/SectionNav.tsx": "Fixed top navigation bar allowing smooth scrolling to site sections and replaying the intro animation.",
  "frontend/src/components/valentine/SurpriseReveal.tsx": "Full‑screen animated reveal screen with floating hearts that fades out before triggering the main experience.",
  "frontend/src/components/valentine/ValentineLayout.tsx": "Section wrapper applying spacing, optional background pattern, and centered layout for Valentine pages.",
  "frontend/src/config/valentineContent.ts": "Configuration object providing all static Valentine text content used across the themed components.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous backend actor, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, handling login, logout, and identity restoration using AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file since no backend queries are needed.",
  "frontend/src/index.css": "Defines Tailwind base styles, color themes, and custom animations for the Valentine's Day design.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider.",
  "frontend/tailwind.config.js": "Configures Tailwind theme, colors, fonts, containers, and animations with plugin support.",
  "project_state.json": "Stores project metadata, features, and requirements for the Valentine experience."
}