{
  "backend/main.mo": "Minimal Motoko actor with no logic implemented.",
  "feature_evidence.json": "Feature evidence report listing two Valentine prompt features and the related files and components.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries for all frontend Valentine components and config files.",
  "frontend/index.css": "Global Tailwind and theme variable definitions for light and dark modes with Valentine color palette.",
  "frontend/index.html": "HTML entrypoint loading fonts and mounting the React app into the root div.",
  "frontend/src/App.tsx": "Main app flow handling first-entry prompt, reveal screen, and rendering all Valentine sections.",
  "frontend/src/components/valentine/ClosingSection.tsx": "Closing section with hearts, final message, and buttons to replay or scroll to top.",
  "frontend/src/components/valentine/FirstEntryLovePrompt.tsx": "Full-screen prompt asking “Do you love me?” with a moving No button and a Yes button that proceeds.",
  "frontend/src/components/valentine/games/LoveQuizGame.tsx": "An interactive love‑themed quiz with multiple questions, scoring, and a results screen with restart option.",
  "frontend/src/components/valentine/games/MemoryMatchGame.tsx": "A memory matching game using icon pairs, tracking moves, matches, and win state with reset support.",
  "frontend/src/components/valentine/HeroSection.tsx": "Hero banner with animated hearts, background image, and button to scroll to the message section.",
  "frontend/src/components/valentine/MessageSection.tsx": "Romantic message section with user-photo background, overlay, and styled paragraphs from config.",
  "frontend/src/components/valentine/PlaySection.tsx": "Game section switching between Memory Match and Love Quiz with themed layout and buttons.",
  "frontend/src/components/valentine/SectionNav.tsx": "A fixed navigation bar with buttons that scroll to page sections and a replay trigger.",
  "frontend/src/components/valentine/SurpriseReveal.tsx": "A full‑screen animated Valentine reveal screen with floating hearts and a button that triggers onReveal.",
  "frontend/src/components/valentine/ValentineLayout.tsx": "A layout wrapper that centers content and optionally adds a repeating Valentine pattern background.",
  "frontend/src/config/valentineContent.ts": "Static configuration for Valentine text content such as headlines, messages, and intro copy.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages a backend actor based on Internet Identity authentication state.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and hooks for managing Internet Identity login, stored identities, and auth client lifecycle.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file noting no backend queries are required for the Valentine page.",
  "frontend/src/index.css": "Defines Tailwind base layers, theme CSS variables for light/dark modes, and custom animation utility classes.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and InternetIdentityProvider, then renders the App component.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, typography, animations, and extended theme settings using project CSS variables.",
  "project_state.json": "Stores project metadata, existing features, and pending requests for the Valentine mini‑game prompt with an evasive No button."
}